[
  {
    "id": 1,
    "name": "The Legend of Zelda: Breath of the Wild",
    "description": "Embark on an unforgettable adventure in The Legend of Zelda: Breath of the Wild. Set in the expansive land of Hyrule, this action RPG offers players the freedom to explore a breathtaking open world, solve intricate puzzles, battle fearsome monsters, and uncover the secrets of a kingdom in ruins. With its captivating story and innovative gameplay mechanics, this game redefines the boundaries of the Zelda series.",
    "price": 49.99,
    "stock": 10,
    "image": "../images/breathofthewild.jpg",
    "category": "Adventure"
  },
  {
    "id": 2,
    "name": "The Witcher 3: Wild Hunt",
    "description": "Embark on a monster-hunting journey in The Witcher 3: Wild Hunt, an action RPG set in a vast and morally complex fantasy world. Play as Geralt of Rivia, a monster hunter known as a Witcher, and navigate a war-torn land filled with political intrigue and mythical creatures. Make choices that affect the course of the story and explore a world rich in detail and lore.",
    "price": 29.99,
    "stock": 8,
    "image": "../images/witcher3.jpg",
    "category": "RPG"
  },
  {
    "id": 3,
    "name": "Red Dead Redemption 2",
    "description": "Saddle up for an epic journey in Red Dead Redemption 2, a western-themed open world adventure. Play as Arthur Morgan, an outlaw on the run, as he navigates the rugged landscapes of America's heartland. Engage in intense gunfights, hunt wildlife, and make choices that shape your honor and reputation. With its stunning visuals and deep storytelling, this game offers an immersive Wild West experience.",
    "price": 39.99,
    "stock": 15,
    "image": "https://example.com/images/red-dead-redemption-2.jpg",
    "category": "Adventure"
  },
  {
    "id": 4,
    "name": "Dark Souls III",
    "description": "Prepare to face relentless challenges in Dark Souls III, a dark and atmospheric action RPG. Traverse a world filled with treacherous enemies, intricate level design, and hidden lore. Test your combat skills against powerful bosses and unravel the mysteries of a dying land. With its unforgiving difficulty and sense of accomplishment, Dark Souls III offers an unforgettable gaming experience.",
    "price": 19.99,
    "stock": 5,
    "image": "https://example.com/images/dark-souls-3.jpg",
    "category": "RPG"
  },
  {
    "id": 5,
    "name": "Horizon Zero Dawn",
    "description": "Uncover the mysteries of a post-apocalyptic world in Horizon Zero Dawn, an action RPG set in a vibrant open world. Play as Aloy, a skilled hunter, and explore lush landscapes inhabited by robotic creatures. Engage in dynamic combat, unravel the secrets of a lost civilization, and discover your own destiny. With its blend of exploration and adventure, Horizon Zero Dawn offers a unique and compelling experience.",
    "price": 24.99,
    "stock": 12,
    "image": "https://example.com/images/horizon-zero-dawn.jpg",
    "category": "RPG"
  },
  {
    "id": 6,
    "name": "Grand Theft Auto V",
    "description": "Step into the sprawling city of Los Santos in Grand Theft Auto V, an open world action game that offers a sandbox playground for criminal endeavors. Play as three protagonists with interconnected stories, engage in heists, explore a vast world, and immerse yourself in a satirical take on modern society. With its dynamic gameplay and rich narrative, GTA V is a landmark in the open-world genre.",
    "price": 14.99,
    "stock": 7,
    "image": "https://example.com/images/gta-v.jpg",
    "category": "Action"
  },
  {
    "id": 7,
    "name": "Uncharted 4: A Thief's End",
    "description": "Join Nathan Drake in his final adventure in Uncharted 4: A Thief's End, an action-packed game that blends cinematic storytelling with thrilling gameplay. Follow Nathan as he embarks on a quest for buried pirate treasure, navigating treacherous terrain, solving intricate puzzles, and facing dangerous foes. With its stunning visuals and emotional depth, Uncharted 4 is a must-play for fans of adventure games.",
    "price": 9.99,
    "stock": 10,
    "image": "https://example.com/images/uncharted-4.jpg",
    "category": "Adventure"
  },
  {
    "id": 8,
    "name": "Dark Souls Remastered",
    "description": "Experience the critically acclaimed Dark Souls in a remastered edition. Enter a dark and atmospheric world filled with challenging enemies and intricate level design. Test your mettle in intense battles, uncover hidden secrets, and master the art of combat in a realm of despair. With its improved visuals and timeless gameplay, Dark Souls Remastered is a definitive edition for both newcomers and veterans.",
    "price": 29.99,
    "stock": 10,
    "image": "https://example.com/images/dark-souls-remastered.jpg",
    "category": "RPG"
  },
  {
    "id": 9,
    "name": "Assassin's Creed Odyssey",
    "description": "Embark on an epic odyssey in ancient Greece with Assassin's Creed Odyssey. Choose between two protagonists, Kassandra and Alexios, and shape your own destiny as a mercenary. Explore a vast open world, engage in naval combat, and uncover the secrets of a powerful artifact. With its expansive landscapes and branching narrative, Assassin's Creed Odyssey offers a captivating journey through history.",
    "price": 34.99,
    "stock": 6,
    "image": "https://example.com/images/assassins-creed-odyssey.jpg",
    "category": "Action"
  },
  {
    "id": 10,
    "name": "Final Fantasy VII Remake",
    "description": "Relive the classic tale of Cloud Strife and his allies in Final Fantasy VII Remake, a reimagining of the beloved JRPG. Explore the city of Midgar in stunning detail, engage in dynamic real-time combat, and experience the iconic story with modern enhancements. With its breathtaking visuals and unforgettable characters, this remake captures the essence of the original while introducing new elements.",
    "price": 44.99,
    "stock": 10,
    "image": "https://example.com/images/final-fantasy-7-remake.jpg",
    "category": "RPG"
  }
]
  